#+TITLE: Elisp for beginners
#+AUTHOR: Niklas Carlsson
#+DATE: 14 October 2018

#+OPTIONS: num:nil reveal_control:nil toc:nil
#+OPTIONS: reveal_title_slide:auto
#+OPTIONS: title:t author:nil date:t email:nil timestamp:nil
#+REVEAL_THEME: moon
#+REVEAL_TRANS: slide

*** An introduction to Emacs Lisp

Resources:
[[https://harryrschwartz.com/2014/04/08/an-introduction-to-emacs-lisp.html][notes from the video]]
[[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html][official reference]]

~In short:~
- atoms are the smallest objects and they evaluate to themselves
- car is first, cdr is rest
- let* makes it possible to have variables that are dependent on others
- null function checks for nil
- when is an if function without an else
- cond is like a switch/case construction

Each line just evaluates to itself
#+BEGIN_SRC elisp
42
3.0
"foo!"
#+END_SRC

Some math calculations
#+BEGIN_SRC elisp
(+ (* 2 3 )
   (/ 8 4))
#+END_SRC

#+RESULTS:
: 8

#+BEGIN_SRC elisp
(1 2 3) ;; gives an error
(quote (1 2 3)) ;; now the list is not evaluated
'(1 2 3) ;; this is a simpler way to write it
#+END_SRC

#+BEGIN_SRC elisp
'() ;;an empty list evaluates to nil
(null nil) ;; null tests if something is nil
#+END_SRC

#+BEGIN_SRC elisp
(cons 1 '(2 3)) ;; constructs a list out of
(append '(1 2) '(3 4)) ;; appends two lists
;; => (1 2 3 4)
(cons '(1 2) '(3 4)) ;; notice the difference between cons and append
;; => ((1 2) 3 4)
#+END_SRC

#+BEGIN_EXAMPLE
The answer is that setq actually isn’t just a function. setq is an example of a
macro. Macros are a bit like functions, but they also make it possible to
manipulate their arguments before they get executed—in this case, the setq macro
implicitly wraps a quote around the first argument. Macros are a big topic
that’s way outside the scope of this tutorial, but they’re just awesome, so I’d
highly recommend checking them out when you get a chance. They’re one of the
things that make Lisp really fun to work with.
#+END_EXAMPLE

#+BEGIN_EXAMPLE
Some functions—= or null, for example—just return t or nil. Lisp programmers
refer to such functions as predicates. Predicates are usually (though not
always) distinguished by being suffixed by “-p”.
#+END_EXAMPLE

#+BEGIN_EXAMPLE
cond is a generalization of if that can match an arbitrary number of cases. It
takes a collection of lists, each of which starts with a Boolean expression. It
runs through each such expression searching for one that matches, then evaluates
the remaining elements in that list and returns the result.
#+END_EXAMPLE

#+BEGIN_SRC elisp
(defun favorite-number (number)
  (cond
   ((= number 1) "one")
   ((= number 2) "two")
   ((= number 3) "three")
   ;; t is always true making this test like the default in a switch case
   (t "eight")))

(favorite-number 3)
;; "three"
(favorite-number 5 )
;; "eight"
#+END_SRC

Recursion example:
#+BEGIN_SRC elisp
(defun factorial (n)
  (if (< n 1)
      1
    (* n (factorial (- n 1)))))

(factorial 5)
;; => 120
#+END_SRC

Lambda example:
#+BEGIN_SRC elisp
;; anonymous cube function
((lambda (x) (* x x x)) 5)
;; => 125
#+END_SRC

#+BEGIN_EXAMPLE
As we’ve seen, we can pretty much treat functions as just another kind of
variable. There’s no reason that we can’t pass them in as arguments to other
functions. Functions that take other functions as arguments are commonly called
higher-order functions, but otherwise there’s nothing special about them. We can
easily write our own.
#+END_EXAMPLE

#+BEGIN_SRC elisp
;; if n is euql to zero return zero otherwise execute incomming function
(defun transform-unless-zero (fn n)
  (if (= n 0)
      0
    (funcall fn n)))

(transform-unless-zero (lambda (n) (+ 1 n)) 0)
;; => 0
(transform-unless-zero (lambda (n) (+ 1 n)) 8)
;; => 9
#+END_SRC

#+BEGIN_EXAMPLE
funcall takes a function and (optionally) some arguments, and calls the function
on those arguments. The function doesn’t even have to be anonymous.
#+END_EXAMPLE

#+BEGIN_EXAMPLE
In fact, they’re so useful that they show up all over the place in Lisp. One of
the most common examples is mapcar. It takes a function and a list, applies the
function to each element in the list, and returns a new list of results.
#+END_EXAMPLE

#+BEGIN_SRC elisp
(mapcar (lambda (n) (interactive) (* (+ 1 n) 2)) '(1 2 3 5 6))
;; => (4 6 8 12 14)
#+END_SRC


Note: Mapcar is nondestructive in terms of the original list

#+BEGIN_SRC elisp
(mapcar 'upcase '("niklas" "katarina" "kiti"))
#+END_SRC

#+RESULTS:
| NIKLAS | KATARINA | KITI |

#+BEGIN_EXAMPLE
remove-if-not is another handy higher-order function. It takes a predicate and a
list. It returns a new list that only contains those items that satisfy the
predicate.
#+END_EXAMPLE

#+BEGIN_SRC elisp
(remove-if-not 'stringp '(1 2 "niklas"))
#+END_SRC

#+RESULTS:
| niklas |

~Example: Quicksort~
#+BEGIN_EXAMPLE
- Pick some element in the list (we’ll just always pick the first element). Call it the pivot.
- Create two other lists, containing all the items that are smaller than the pivot and all the items that are larger.
- Apply quicksort to both of the smaller and larger lists, recursing down until we hit the empty list.
- Join the smaller list, the pivot, and the larger list into one new list and return it. Done.
#+END_EXAMPLE

#+BEGIN_SRC elisp
(defun qs (input)
  (if (null input)
      ;; reached the end of the list return an empty list
      '()
    (let* ((pivot (car input))
           (rest (cdr input))
           ;; remove the numbers that are larger than pivot
           (smaller (remove-if (lambda (value) (> value pivot)) rest))
           ;; remove the numbers that are smaller than pivot
           (larger (remove-if (lambda (value) (<= value pivot)) rest)))
      ;; Sort smaller and larger until one of them becomes null, then return the
      (append (qs smaller) (list pivot) (qs larger)))))

(qs '(4 7 2 3 8 5 9))
#+END_SRC
